<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Kapitola 5. Z&aacute;v&#283;r</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Popis fotbalov&eacute; ligy"><link rel="up" href="index.html" title="Popis fotbalov&eacute; ligy"><link rel="prev" href="ch04s03.html" title="Probl&eacute;my"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Kapitola 5. Z&aacute;v&#283;r</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ch04s03.html">P&#345;edch&aacute;zej&iacute;c&iacute;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;</td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e200"></a>Kapitola 5. Z&aacute;v&#283;r</h1></div></div></div><p>Z&aacute;v&#283;r bych v&#283;noval shrnut&iacute; semestr&aacute;ln&iacute; pr&aacute;ce a jej&iacute; p&#345;&iacute;nos.</p><p>V p&#345;&iacute;pad&#283; uve&#345;ejn&#283;n&iacute; by pr&aacute;ce mohla slou&#382;it jako uk&aacute;zka mo&#382;nost&iacute; &#345;e&#353;en&iacute; jednotliv&yacute;ch problematik, nicm&eacute;n&#283; jsem si v&#283;dom nedostatk&#367;.</p><p>Mus&iacute;m uznat, &#382;e semestr&aacute;ln&iacute; pr&aacute;ce mi poskytla cennou praktickou zku&#353;enost s XML a transformac&iacute;, co&#382; je obrovsk&aacute; v&yacute;hoda, oproti ostatn&iacute;m kurz&#367;m tady na &#353;kole. De facto k sestaven&iacute; semestr&aacute;ln&iacute; pr&aacute;ce je t&#345;eba &uacute;&#269;ast na cvi&#269;en&iacute;ch a eventu&aacute;ln&iacute; samostudium.</p><p>Materi&aacute;l&#367; je opravdu hodn&#283; a jsou velmi dob&#345;e pops&aacute;ny a i komplexn&iacute;, tedy zahrnuj&iacute; t&eacute;m&#283;&#345; v&#353;echny metody transformac&iacute;. Na druhou stranu v tom vid&iacute;m jistou nev&yacute;hodu, proto&#382;e materi&aacute;ly a p&#345;&iacute;klady jsou natolik obs&aacute;hl&eacute;, &#382;e se v nich za&#269;&aacute;te&#269;n&iacute;k snadno ztrat&iacute;, obzvl&aacute;&#353;t&#283; student, kter&yacute; nem&aacute; ani zku&#353;enosti se sestavov&aacute;n&iacute;m HTML str&aacute;nek. V tomto p&#345;&iacute;pad&#283; by hodn&#283; pomohla baby-edice tutori&aacute;lu, respektive pops&aacute;n&iacute; jen toho nejpodstatn&#283;j&#353;&iacute;ho na nejjednodu&#353;&#353;&iacute;ch p&#345;&iacute;kadech s c&iacute;len&yacute;mi popisky.</p><p>Podle m&eacute;ho nen&iacute; mo&#382;n&eacute; probrat v&#353;echny z&aacute;kladn&iacute; techniky sch&eacute;mat a transformac&iacute; v r&aacute;mci jedin&eacute;ho kurzu. Obs&aacute;hlost kurzu je takov&aacute;, &#382;e se student snadno ztrat&iacute;.</p><p>Celkov&#283; ale beru kurz jako velice p&#345;&iacute;nosn&yacute;, na jeho&#382; cvi&#269;en&iacute; jsem se opravdu t&#283;&#353;il, a kter&yacute; r&aacute;d vyu&#382;iju v budoucnu.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ch04s03.html">P&#345;edch&aacute;zej&iacute;c&iacute;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;</td></tr><tr><td width="40%" align="left" valign="top">Probl&eacute;my&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Dom&#367;</a></td><td width="40%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>